# Задание 3
num1 = int(input('Здравствуйте, нет времени объяснять, введите число: '))
num2 = int(f'{num1}{num1}')
num3 = int(f'{num1}{num1}{num1}')
sum = num1 + num2 + num3
print(sum)




